FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*---------------------------------------------------------------------------*/

static BaseType_t prvEMACTaskStart( ETH_HandleTypeDef * pxEthHandle )
{
    BaseType_t xResult = pdFALSE;

    if( xTxMutex == NULL )
    {
        #if ( configSUPPORT_STATIC_ALLOCATION != 0 )
            static StaticSemaphore_t xTxMutexBuf;
            xTxMutex = xSemaphoreCreateMutexStatic( &xTxMutexBuf );
        #else
            xTxMutex = xSemaphoreCreateMutex();
        #endif
        configASSERT( xTxMutex != NULL );
        vQueueAddToRegistry( xTxMutex, niEMAC_TX_MUTEX_NAME );
    }

    if( xTxDescSem == NULL )
    {
        #if ( configSUPPORT_STATIC_ALLOCATION != 0 )
            static StaticSemaphore_t xTxDescSemBuf;
            xTxDescSem = xSemaphoreCreateCountingStatic(
                ( UBaseType_t ) ETH_TX_DESC_CNT,
                ( UBaseType_t ) ETH_TX_DESC_CNT,
                &xTxDescSemBuf
            );
        #else
            xTxDescSem = xSemaphoreCreateCounting(
                ( UBaseType_t ) ETH_TX_DESC_CNT,
                ( UBaseType_t ) ETH_TX_DESC_CNT
            );
        #endif
        configASSERT( xTxDescSem != NULL );
        vQueueAddToRegistry( xTxDescSem, niEMAC_TX_DESC_SEM_NAME );
    }

    if( xEMACTaskHandle == NULL && ( xTxMutex != NULL ) && ( xTxDescSem != NULL ) )
    {
        #if ( configSUPPORT_STATIC_ALLOCATION != 0 )
            static StackType_t uxEMACTaskStack[ niEMAC_TASK_STACK_SIZE ];
            static StaticTask_t xEMACTaskTCB;
            xEMACTaskHandle = xTaskCreateStatic(
                prvEMACHandlerTask,
                niEMAC_TASK_NAME,
                niEMAC_TASK_STACK_SIZE,
                ( void * ) pxEthHandle,
                niEMAC_TASK_PRIORITY,
                uxEMACTaskStack,
                &xEMACTaskTCB
            );
        #else
            ( void ) xTaskCreate(
                prvEMACHandlerTask,
                niEMAC_TASK_NAME,
                niEMAC_TASK_STACK_SIZE,
                ( void * ) pxEthHandle,
                niEMAC_TASK_PRIORITY,
                &xEMACTaskHandle
            );
        #endif
    }

    if( xEMACTaskHandle != NULL )
    {
        xResult = pdTRUE;
    }

    return xResult;
}

/*===========================================================================*/
/*                               EMAC Init                                   */
/*===========================================================================*/

static BaseType_t prvEthConfigInit( ETH_HandleTypeDef * pxEthHandle, const NetworkInterface_t * pxInterface )
{
    BaseType_t xResult = pdFALSE;

    pxEthHandle->Instance = ETH;

    #if ( niEMAC_USE_RMII != 0 )
        pxEthHandle->Init.MediaInterface = HAL_ETH_RMII_MODE;
    #else
        pxEthHandle->Init.MediaInterface = HAL_ETH_MII_MODE;
    #endif

    pxEthHandle->Init.RxBuffLen = niEMAC_DATA_BUFFER_SIZE;
    configASSERT( pxEthHandle->Init.RxBuffLen <= ETH_MAX_PACKET_SIZE );
    configASSERT( pxEthHandle->Init.RxBuffLen % 4U == 0 );

    static ETH_DMADescTypeDef xDMADescRx[ ETH_RX_DESC_CNT ] __ALIGNED( portBYTE_ALIGNMENT ) __attribute__( ( section( niEMAC_RX_DESC_SECTION ) ) );
    static ETH_DMADescTypeDef xDMADescTx[ ETH_TX_DESC_CNT ] __ALIGNED( portBYTE_ALIGNMENT ) __attribute__( ( section( niEMAC_TX_DESC_SECTION ) ) );

    pxEthHandle->Init.TxDesc = xDMADescTx;
    pxEthHandle->Init.RxDesc = xDMADescRx;

    ( void ) memset( &xDMADescTx, 0, sizeof( xDMADescTx ) );
    ( void ) memset( &xDMADescRx, 0, sizeof( xDMADescRx ) );

    const NetworkEndPoint_t * const pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface );
    if( pxEndPoint != NULL )
    {
        pxEthHandle->Init.MACAddr = ( uint8_t * ) pxEndPoint->xMACAddress.ucBytes;

        #if defined( STM32F7 ) || defined( STM32F4 )
            /* This function doesn't get called in Fxx driver */
            HAL_ETH_SetMDIOClockRange( pxEthHandle );
        #endif

        if( HAL_ETH_Init( pxEthHandle ) == HAL_OK )
        {
            xResult = pdTRUE;
        }
        /* else
        {
            pxEthHandle->ErrorCode & HAL_ETH_ERROR_TIMEOUT
        } */
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static void prvInitMACAddresses( ETH_HandleTypeDef * pxEthHandle, NetworkInterface_t * pxInterface )
{
    /* #if ( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES != 0 )
        ETH_MACFilterConfigTypeDef xFilterConfig;
        ( void ) HAL_ETH_GetMACFilterConfig( pxEthHandle, &xFilterConfig );
    #endif */

    #if ( ipconfigUSE_MDNS != 0 )
        prvMACAddressConfig( pxEthHandle, xMDNS_MacAddress.ucBytes );
        #if ( ipconfigUSE_IPv6 != 0 )
            prvMACAddressConfig( pxEthHandle, xMDNS_MACAddressIPv6.ucBytes );
        #endif
    #endif

    #if ( ipconfigUSE_LLMNR != 0 )
        prvMACAddressConfig( pxEthHandle, xLLMNR_MacAddress.ucBytes );
        #if ( ipconfigUSE_IPv6 != 0 )
            prvMACAddressConfig( pxEthHandle, xLLMNR_MacAddressIPv6.ucBytes );
        #endif
    #endif

    for( NetworkEndPoint_t * pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface ); pxEndPoint != NULL; pxEndPoint = FreeRTOS_NextEndPoint( pxInterface, pxEndPoint ) )
    {
        #if ( ipconfigUSE_IPv6 != 0 )
            if( pxEndPoint->bits.bIPv6 != pdFALSE_UNSIGNED )
            {
                const uint8_t ucMACAddress[ ipMAC_ADDRESS_LENGTH_BYTES ] = {
                    0x33,
                    0x33,
                    0xff,
                    pxEndPoint->ipv6_settings.xIPAddress.ucBytes[ 13 ],
                    pxEndPoint->ipv6_settings.xIPAddress.ucBytes[ 14 ],
                    pxEndPoint->ipv6_settings.xIPAddress.ucBytes[ 15 ]
                };
                prvMACAddressConfig( pxEthHandle, ucMACAddress );
            }
        #else
            if( pxEthHandle->Init.MACAddr != ( uint8_t * ) pxEndPoint->xMACAddress.ucBytes )
            {
                prvMACAddressConfig( pxEthHandle, pxEndPoint->xMACAddress.ucBytes );
            }
        #endif /* if ( ipconfigUSE_IPv6 != 0 ) */
    }

    #if ( ipconfigUSE_IPv6 != 0 )
        prvMACAddressConfig( pxEthHandle, pcLOCAL_ALL_NODES_MULTICAST_MAC.ucBytes );
    #endif

    /* #if ( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES != 0 )
        ( void ) HAL_ETH_SetMACFilterConfig( pxEthHandle, &xFilterConfig );
    #endif */
}

